---
kind: type
id: T:Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray3d
source: html/f0623332-e4b1-3b6f-7247-8ee16a27251c.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray3d

Represents a vector or point property.

## Syntax (C#)
```csharp
public class AssetPropertyDoubleArray3d : AssetProperty
```